{
    "chapters": [
      {
        "chapter_number": 1,
        "name": "Arjuna Vishada Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "धृतराष्ट्र उवाच\nधर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः।\nमामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय॥",
            "translation": "Dhritarashtra said: O Sanjaya, after assembling in the place of pilgrimage at Kurukshetra, what did my sons and the sons of Pandu do, being desirous to fight?",
            "purport": "Dhritarashtra, the father of the Kurus, was blind from birth and anxious about the outcome of the impending war between his sons (the Kauravas) and the sons of his brother Pandu (the Pandavas). Kurukshetra, a holy place of pilgrimage, sets the stage for the discourse of the Gita, highlighting the conflict between righteousness and unrighteousness."
          },
          {
            "verse_number": 2,
            "text": "सञ्जय उवाच\nदृष्ट्वा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा।\nआचार्यमुपसङ्गम्य राजा वचनमब्रवीत्॥",
            "translation": "Sanjaya said: O King, after looking over the army gathered by the sons of Pandu, King Duryodhana went to his teacher and began to speak the following words:",
            "purport": "Sanjaya, gifted with divine vision by Vyasa, narrates the events to Dhritarashtra. Duryodhana, the eldest Kaurava, approaches his teacher Dronacharya to assess the enemy’s strength, revealing his pride and apprehension about the Pandava army’s formation."
          }
        ]
      },
      {
        "chapter_number": 2,
        "name": "Sankhya Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "सञ्जय उवाच\nतं तथा कृपयाविष्टमश्रुपूर्णाकुलेक्षणम्।\nविषीदन्तमिदं वाक्यमुवाच मधुसूदनः॥",
            "translation": "Sanjaya said: Seeing Arjuna full of compassion, his mind depressed, his eyes full of tears, Madhusudana, Krishna, spoke the following words.",
            "purport": "Arjuna’s despondency marks the turning point where Krishna begins His divine instruction. The name 'Madhusudana' (slayer of the demon Madhu) suggests Krishna’s role as a destroyer of ignorance, preparing to enlighten Arjuna."
          },
          {
            "verse_number": 2,
            "text": "श्रीभगवानुवाच\nकुतस्त्वा कश्मलमिदं विषमे समुपस्थितम्।\nअनार्यजुष्टमस्वर्ग्यमकीर्तिकरमर्जुन॥",
            "translation": "The Supreme Personality of Godhead said: My dear Arjuna, how have these impurities come upon you? They are not at all befitting a man who knows the value of life. They lead not to higher planets but to infamy.",
            "purport": "Krishna admonishes Arjuna for succumbing to weakness, urging him to rise above petty sentiments unsuitable for a warrior of his stature. This verse introduces the philosophical foundation of duty and detachment."
          }
        ]
      },
      {
        "chapter_number": 3,
        "name": "Karma Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "अर्जुन उवाच\nज्यायसी चेत्कर्मणस्ते मता बुद्धिर्जनार्दन।\nतत्किं कर्मणि घोरे मां नियोजयसि केशव॥",
            "translation": "Arjuna said: O Janardana, O Keshava, why do You want to engage me in this ghastly warfare, if You think that intelligence is better than fruitive work?",
            "purport": "Arjuna’s confusion reflects a common human dilemma: the conflict between action and renunciation. He questions Krishna’s apparent contradiction, seeking clarity on the path of duty versus knowledge."
          }
        ]
      },
      {
        "chapter_number": 4,
        "name": "Jnana Karma Sanyasa Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "श्रीभगवानुवाच\nइमं विवस्वते योगं प्रोक्तवानहमव्ययम्।\nविवस्वान्मनवे प्राह मनुरिक्ष्वाकवेऽब्रवीत्॥",
            "translation": "The Personality of Godhead, Lord Sri Krishna, said: I instructed this imperishable science of yoga to the sun-god, Vivasvan, and Vivasvan instructed it to Manu, the father of mankind, and Manu in turn instructed it to Ikshvaku.",
            "purport": "Krishna establishes the ancient lineage of the Gita’s teachings, emphasizing its eternal relevance and divine origin, passed down through generations of great kings and sages."
          }
        ]
      },
      {
        "chapter_number": 5,
        "name": "Karma Sanyasa Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "अर्जुन उवाच\nसंन्यासं कर्मणां कृष्ण पुनर्योगं च शंससि।\nयच्छ्रेय एतयोरेकं तन्मे ब्रूहि सुनिश्चितम्॥",
            "translation": "Arjuna said: O Krishna, first of all You ask me to renounce work, and then again You recommend work with devotion. Now will You kindly tell me definitely which of the two is more beneficial?",
            "purport": "Arjuna seeks a definitive answer about whether to renounce action entirely or perform it with detachment, prompting Krishna to elaborate on the synthesis of renunciation and selfless action."
          }
        ]
      },
      {
        "chapter_number": 6,
        "name": "Dhyana Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "श्रीभगवानुवाच\nअनाश्रितः कर्मफलं कार्यं कर्म करोति यः।\nस संन्यासी च योगी च न निरग्निर्न चाक्रियः॥",
            "translation": "The Supreme Personality of Godhead said: One who is unattached to the fruits of his work and who works as he is obligated is in the renounced order of life, and he is the true mystic: not he who lights no fire and performs no duty.",
            "purport": "Krishna defines true renunciation as performing one’s duty without attachment to results, distinguishing it from mere external abstinence from action."
          }
        ]
      },
      {
        "chapter_number": 7,
        "name": "Jnana Vijnana Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "श्रीभगवानुवाच\nमय्यासक्तमनाः पार्थ योगं युञ्जन्मदाश्रयः।\nअसंशयं समग्रं मां यथा ज्ञास्यसि तच्छृणु॥",
            "translation": "The Supreme Personality of Godhead said: Now hear, O son of Pritha, how by practicing yoga in full consciousness of Me, with mind attached to Me, you can know Me in full, free from doubt.",
            "purport": "Krishna introduces the path of devotional yoga, emphasizing complete surrender and attachment to Him as the means to ultimate knowledge and liberation."
          }
        ]
      },
      {
        "chapter_number": 8,
        "name": "Akshara Brahma Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "अर्जुन उवाच\nकिं तद्ब्रह्म किमध्यात्मं किं कर्म पुरुषोत्तम।\nअधिभूतं च किं प्रोक्तमधिदैवं किमुच्यते॥",
            "translation": "Arjuna inquired: O my Lord, O Supreme Person, what is Brahman? What is the self? What are fruitive activities? What is this material manifestation? And what are the demigods? Please explain this to me.",
            "purport": "Arjuna’s questions reflect his desire to understand the metaphysical concepts Krishna has alluded to, setting the stage for a detailed exposition of the eternal and the temporary."
          }
        ]
      },
      {
        "chapter_number": 9,
        "name": "Raja Vidya Raja Guhya Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "श्रीभगवानुवाच\nइदं तु ते गुह्यतमं प्रवक्ष्याम्यनसूयवे।\nज्ञानं विज्ञानसहितं यज्ज्ञात्वा मोक्ष्यसेऽशुभात्॥",
            "translation": "The Supreme Personality of Godhead said: My dear Arjuna, because you are never envious of Me, I shall impart to you this most confidential knowledge and realization, knowing which you shall be relieved of the miseries of material existence.",
            "purport": "Krishna praises Arjuna’s humility and receptivity, promising to reveal the most secret wisdom that leads to liberation from material suffering."
          }
        ]
      },
      {
        "chapter_number": 10,
        "name": "Vibhuti Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "श्रीभगवानुवाच\nभूय एव महाबाहो शृणु मे परमं वचः।\nयत्तेऽहं प्रीयमाणाय वक्ष्यामि हितकाम्यया॥",
            "translation": "The Supreme Personality of Godhead said: Listen again, O mighty-armed Arjuna. Because you are My dear friend, for your benefit I shall speak to you further, giving knowledge that is better than what I have already explained.",
            "purport": "Krishna expresses His affection for Arjuna, preparing to describe His divine opulences to deepen Arjuna’s understanding and devotion."
          }
        ]
      },
      {
        "chapter_number": 11,
        "name": "Vishwarupa Darshana Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "अर्जुन उवाच\nमदनुग्रहाय परमं गुह्यमध्यात्मसंज्ञितम्।\nयत्त्वयोक्तं वचस्तेन मोहोऽयं विगतो मम॥",
            "translation": "Arjuna said: By my hearing the instructions You have kindly given me about these most confidential spiritual subjects, my illusion has now been dispelled.",
            "purport": "Arjuna acknowledges the transformative power of Krishna’s teachings, which have cleared his doubts, paving the way for the vision of Krishna’s universal form."
          }
        ]
      },
      {
        "chapter_number": 12,
        "name": "Bhakti Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "अर्जुन उवाच\nएवं सततयुक्ता ये भक्तास्त्वां पर्युपासते।\nये चाप्यक्षरमव्यक्तं तेषां के योगवित्तमाः॥",
            "translation": "Arjuna inquired: Which are considered to be more perfect, those who are always properly engaged in Your devotional service or those who worship the impersonal Brahman, the unmanifested?",
            "purport": "Arjuna seeks to understand the superiority between personal devotion to Krishna and impersonal meditation on the absolute, prompting Krishna to extol bhakti."
          }
        ]
      },
      {
        "chapter_number": 13,
        "name": "Kshetra Kshetrajna Vibhaga Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "अर्जुन उवाच\nप्रकृतिं पुरुषं चैव क्षेत्रं क्षेत्रज्ञमेव च।\nएतद्वेदितुमिच्छामि ज्ञानं ज्ञेयं च केशव॥",
            "translation": "Arjuna said: O my dear Krishna, I wish to know about prakriti [nature], purusha [the enjoyer], and the field and the knower of the field, and of knowledge and the object of knowledge.",
            "purport": "Arjuna’s inquiry delves into the dualities of material nature and the soul, seeking to differentiate between the body and the consciousness that animates it."
          }
        ]
      },
      {
        "chapter_number": 14,
        "name": "Gunatraya Vibhaga Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "श्रीभगवानुवाच\nपरं भूयः प्रवक्ष्यामि ज्ञानानां ज्ञानमुत्तमम्।\nयज्ज्ञात्वा मुनयः सर्वे परां सिद्धिमितो गताः॥",
            "translation": "The Supreme Personality of Godhead said: Again I shall declare to you this supreme wisdom, the best of all knowledge, knowing which all the sages have attained the supreme perfection.",
            "purport": "Krishna introduces the knowledge of the three modes of material nature (goodness, passion, ignorance), which bind the soul, and the means to transcend them."
          }
        ]
      },
      {
        "chapter_number": 15,
        "name": "Purushottama Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "श्रीभगवानुवाच\nऊर्ध्वमूलमधःशाखमश्वत्थं प्राहुरव्ययम्।\nछन्दांसि यस्य पर्णानि यस्तं वेद स वेदवित्॥",
            "translation": "The Supreme Personality of Godhead said: It is said that there is an imperishable banyan tree that has its roots upward and its branches down and whose leaves are the Vedic hymns. One who knows this tree is the knower of the Vedas.",
            "purport": "Krishna uses the metaphor of an inverted tree to describe the material world, rooted in the Supreme, encouraging detachment from its entanglements."
          }
        ]
      },
      {
        "chapter_number": 16,
        "name": "Daivasura Sampad Vibhaga Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "श्रीभगवानुवाच\nअभयं सत्त्वसंशुद्धिर्ज्ञानयोगव्यवस्थितिः।\nदानं दमश्च यज्ञश्च स्वाध्यायस्तप आर्जवम्॥",
            "translation": "The Supreme Personality of Godhead said: Fearlessness; purification of one's existence; cultivation of spiritual knowledge; charity; self-control; performance of sacrifice; study of the Vedas; austerity; simplicity—are the transcendental qualities belonging to godly men endowed with divine nature.",
            "purport": "Krishna lists the divine qualities that elevate the soul, contrasting them with demonic traits, guiding Arjuna toward a virtuous life."
          }
        ]
      },
      {
        "chapter_number": 17,
        "name": "Shraddhatraya Vibhaga Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "अर्जुन उवाच\nये शास्त्रविधिमुत्सृज्य यजन्ते श्रद्धयान्विताः।\nतेषां निष्ठा तु का कृष्ण सत्त्वमाहो रजस्तमः॥",
            "translation": "Arjuna inquired: O Krishna, what is the situation of those who do not follow the principles of scripture but worship according to their own imagination? Are they in goodness, in passion or in ignorance?",
            "purport": "Arjuna questions the validity of faith outside scriptural injunctions, leading Krishna to explain how the modes of nature influence one’s beliefs and actions."
          }
        ]
      },
      {
        "chapter_number": 18,
        "name": "Moksha Sanyasa Yoga",
        "verses": [
          {
            "verse_number": 1,
            "text": "अर्जुन उवाच\nसंन्यासस्य महाबाहो तत्त्वमिच्छामि वेदितुम्।\nत्यागस्य च हृषीकेश पृथक्केशिनिषूदन॥",
            "translation": "Arjuna said: O mighty-armed one, I wish to understand the purpose of renunciation [tyaga] and of the renounced order of life [sannyasa], O killer of the Keshi demon, master of the senses.",
            "purport": "In the final chapter, Arjuna seeks to grasp the essence of renunciation and surrender, culminating in Krishna’s comprehensive summary of the Gita’s teachings."
          }
        ]
      }
    ]
  }